In [1]:
import os
os.chdir('C:/Users/raj3599/Desktop/letsuprade/Day17/Dataset for Pandas Assinment')

In [2]:
%matplotlib inline
import pandas as pd

In [3]:

release_date = pd.read_csv("release_dates.csv")
cast = pd.read_csv('cast.csv')

In [4]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

# How many movies are listed in the titles dataframe?

In [5]:
print("No of movies listed are",titles['title'].count())

No of movies listed are 244914

# What are the earliest two films listed in the titles dataframe?

In [6]:
print("earliest two films list:")
titles.sort_values('year').head(2)

earliest two films list:

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

# How many movies have the title "Hamlet"?

In [7]:
hamlet_len=len(titles[titles["title"]=="Hamlet"])
print('number of movies with hamlet as title are  ',hamlet_len)

number of movies with hamlet as title are   20

# How many movies are titled "North by Northwest"?

In [8]:
North_by_Northwest=len(titles[titles["title"]=="North by Northwest"])
print('number of movies with hamlet as title are  ',North_by_Northwest)

number of movies with hamlet as title are   1

# When was the first movie titled "Hamlet" made?

In [9]:
date_ham=titles[titles["title"]=="Hamlet"].sort_values('year')
print('first movie titled Hamlet was made on', date_ham.iloc[1]     )

first movie titled Hamlet was made on title    Hamlet
year       1911
Name: 198234, dtype: object

# List all of the "Treasure Island" movies from earliest to most recent.

In [10]:
titles[titles['title']=='Treasure Island'].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

# How many movies were made in the year 1950?

In [11]:
print("No of movies made in the year 1950:",len(titles[titles["year"]==1950]))

No of movies made in the year 1950: 1113

# How many movies were made in the year 1960?

In [12]:
print("No of movies made in the year 1960:",len(titles[titles["year"]==1960]))

No of movies made in the year 1960: 1549

# How many movies were made from 1950 through 1959?

In [13]:
print("No of movies made from the year 1950 to 1959 are:",len(titles[(titles["year"] >= 1950) & (titles["year"] <=1959)]))

No of movies made from the year 1950 to 1959 are: 12934

# In what years has a movie titled "Batman" been released?

In [14]:
titles[titles["title"]=="Batman"]

         title  year
39349   Batman  1943
240896  Batman  1989

# How many roles were there in the movie "Inception"?

In [15]:
len(cast[cast['title']=='Inception'])

78

# How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [16]:
cast[cast['title'] == 'Inception']['n'].isnull().sum()

27

# But how many roles in the movie "Inception" did receive an "n" value?

In [17]:

cast[cast['title'] == 'Inception']['n'].notnull().sum()

51

# Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [18]:

X = cast[cast.title == 'North by Northwest'].sort_values('n')
X[X['n'].notna()]

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

# Display the entire cast, in "n"-order, of the 1972 film "Sleuth"

In [19]:

temp = cast[(cast['title']=='Sleuth') & (cast['n'].notnull()) & (cast['year']==1972)]
temp[['name','n']].sort_values('n')

                       name    n
1705394    Laurence Olivier  1.0
326773        Michael Caine  2.0
373876       Alec Cawthorne  3.0
1465483  John (II) Matthews  4.0
2724553  Eve (III) Channing  5.0
1448690        Teddy Martin  6.0

# Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth"

In [20]:

temp = cast[(cast['title']=='Sleuth') & (cast['n'].notnull()) & (cast['year']==2007)]
temp[['name','n']].sort_values('n')

                  name    n
326774   Michael Caine  1.0
1293634       Jude Law  2.0
1805907  Harold Pinter  3.0

# How many roles were credited in the silent 1921 version of Hamlet?

In [21]:
cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1921)].character.shape[0]

9

# How many roles were credited in Branagh’s 1996 Hamlet?

In [22]:
cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1996)].character.shape[0]

54

# How many "Hamlet" roles have been listed in all film credits through history?

In [23]:
cast[cast['title'] == 'Hamlet'].character.shape[0]

342

# How many people have played an "Ophelia"?

In [24]:
cast[cast['title'] == 'Ophelia'].character.shape[0]

20

# How many people have played a role called "The Dude"?

In [25]:
cast[cast['character']=='The Dude'].character.shape[0]

19

# How many people have played a role called "The Stranger"?

In [26]:
cast[cast['character'] == 'The Stranger'].character.shape[0]

212

# How many roles has Sidney Poitier played throughout his career?

In [27]:
cast[cast['name'] == 'Sidney Poitier'].shape[0]

43

# How many roles has Judi Dench played?

In [28]:
cast[cast['name'] == 'Judi Dench'].character.shape[0]

55

# List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [29]:
cast[(cast['name']=='Cary Grant') & (cast['year']==1940) & (cast['n']==2)]

                   title  year        name   type   character    n
871423  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

# List the leading roles that Cary Grant played in the 1940s in order by year.

In [30]:
cast[(cast['name']=='Cary Grant') & (cast['year']==1940) & (cast['n']==1)].character

871407          Walter Burns
871448           Matt Howard
871450    C. K. Dexter Haven
Name: character, dtype: object

# How many roles were available for actors in the 1950s?

In [31]:
cast[(cast['year']==1950) & (cast['type']=='actor')].character.shape[0]

16760

# How many roles were available for actresses in the 1950s?

In [32]:
cast[(cast['year']==1950) & (cast['type']=='actress')].character.shape[0]

5637

# How many leading roles (n=1) were available from the beginning of film history through 1980?

In [33]:
cast[(cast['year']<1980) & (cast['n']==1)].shape[0]

63957

# How many non-leading roles were available through from the beginning of film history through 1980?

In [34]:
cast[(cast['year']<1980) & (cast['n']!=1)].shape[0]

1095378

# How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [35]:
cast[(cast['year']<=1980) & (cast['n'].isnull())].shape[0]

448347